<?php
  // Если константа FIRST из файла 1.php 
  // не определена производится попытка
  // непосредственного обращения к обработчику
  // минуя первый файл - пресекаем эту попытку
  if (!defined('FIRST')) exit();
  // Если передан параметр $_POST['edit'],
  // пользователь воспользовался формой для
  // редактирования данных
  if($_POST['edit'] == 'edit')
  {
    /////////////////////////////////////////////////
    // Блок проверки правильности данных
    /////////////////////////////////////////////////
    // Удаляем лишние пробелы
    $_POST['name'] = trim($_POST['name']);
    $_POST['passw'] = trim($_POST['passw']);
    $_POST['pass_again'] = trim($_POST['pass_again']);
    // Проверяем не пустой ли суперглобальный массив $_POST
    if(empty($_POST['name'])) exit();
    // Проверяем правильно ли заполнены обязательные поля
    if(empty($_POST['name'])) exit('Поле "Имя" не заполнено');
    if(empty($_POST['passw']))
       exit('Одно из полей "Пароль" не заполнено');
    if(empty($_POST['pass_again']))
       exit('Одно из полей "Пароль" не заполнено');
    if($_POST['passw'] != $_POST['pass_again'])
       exit('Пароли не совпадают');
    // Если введён e-mail проверяем его на соответсвие
    if(!empty($_POST['email']))
    {
      if(!preg_match("|^[0-9a-z_]+@[0-9a-z_^\.]+\.[a-z]{2,6}$|i",
         $_POST['email']))
      {
        exit('Поле "E-mail" должно соответствовать формату
              somebody@somewhere.ru');
      }
    }

    /////////////////////////////////////////////////
    // Редактируем содержимое файла данных
    /////////////////////////////////////////////////
    $arr = file($filename);
    $linefile = array();
    foreach($arr as $line)
    {
      // Разбиваем строку по разделителю ::
      $data = explode("::",$line);
      if($data[0] == $temp['name'][$index])
      {
        // Формируем новую строку вместо старой
        $linefile[] = $_POST['name']."::".$_POST['passw']."::".
                      $_POST['email']."::".$_POST['url'];
        $temp['password'][$index] = $_POST['passw'];
        $temp['email'][$index]    = $_POST['email'];
        $temp['url'][$index]      = $_POST['url'];
      }
      else $linefile[] = trim($line);
    }

    /////////////////////////////////////////////////
    // Перезаписываем файл данных
    /////////////////////////////////////////////////
    $fd = fopen($filename,"w");
    if(!$fd) exit("Ошибка записи в файл");
    fwrite($fd,implode("\r\n",$linefile));
    fclose($fd);
  }
?>